// pages/anjia/anjia.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
  
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    this.setData({
      title1:"纯天然才是最好的",
      title2:"科学的营养理论",
      title3:"品质食品带来品质生活",
      content1: "安佳牛奶来自于纯净的“人间净土”——新西兰。新西兰温暖湿润的气候适合草场生长，而冬季的气候亦相当温和，所以奶牛得以全年放养于露天草场，完全无需喂养饲料。\n新西兰得天独厚的环境蕴育了全世界优质的牧场，这里可以生产出纯天然的奶制品。",
      content2: "作为乳品领域的专家，恒天然几代人专注于乳品研究和创新，相关投资达行业之最。公司位于新西兰的乳品研发中心，是世界最为先进的乳品研究机构之一，致力于提高业界对于牧场到终用户的各个环节的乳制品知识，促进乳制品行业的健康发展。\n安佳纯牛奶、儿童牛奶、奶粉，以及黄油、淡奶油、芝士等产品可以满足全家人对于每日营养的需要。",
      content3:"安佳是全球知名乳制品品牌，隶属于恒天然集团，拥有130多年的悠久历史，产品畅销70多个国家。全球领先的食品安全和质量标准，安佳严格掌控“从牧场到餐桌”供应链的每一步。"
    })
  
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})